{
  "architectures": [
    "Qwen3VLForConditionalGeneration"
  ],
  "hidden_size": 2048,
  "num_hidden_layers": 28,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "vocab_size": 3072,
  "rope_theta": 1000000,
  "rope_scaling": {
    "interleaved": true,
    "mrope_section": [
      24,
      20,
      20
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rms_norm_eps": 1e-06,
  "intermediate_size": 6144,
  "hidden_act": "silu",
  "attention_dropout": 0,
  "attention_bias": false,
  "max_position_embeddings": 32768,
  "vision_config": {
    "deepstack_visual_indexes": []
  },
  "model_type": "qwen3_vl",
  "use_cache": true,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "_original_model": "qwen3_tts_talker",
  "_converted_from": "Standalone-Bare-Master"
}